//   = ตัวดำเนินการกำหนดค่า (Assignment Operator)
//      ใช้กำหนดค่าให้กับตัวแปร

//  == ตัวดำเนินการเปรียบเทียบความเท่ากัน (Comparison Operator)
//      เปรียบเทียบว่า "ค่า" เท่ากันหรือไม่

// === ตัวดำเนินการเปรียบเทียบความเท่ากันแบบเคร่งครัด (Strict Equality Operator)
//      เปรียบเทียบทั้ง "ค่า" และ "ชนิดข้อมูล (Data Type)" ว่าเท่ากันหรือไม่

//  != ตัวดำเนินการเปรียบเทียบความไม่เท่ากัน (Inequality Operator)

// !== ตัวดำเนินการเปรียบเทียบความไม่เท่ากันแบบเคร่งครัด (Strict Inequality Operator)
//      เปรียบเทียบทั้ง "ค่า" และ "ชนิดข้อมูล" ว่าไม่เท่ากันหรือไม่

const PI = 3.14;

if (PI === "3.14") {
    console.log("That id Pi");
}
else {
    console.log("That is NOT Pi"); // That is NOT Pi
}